app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-09-07 14:47:22', '045c081dd716bf1f4004f2ae76c158639f188e2c75b4670c62d98f4022bcb0c8c1bdd9577a73608f1776cd4d2b1f8686fedf6331fef934eb719048589f814e28', '2010-09-07 14:47:22', 'prashanth', 'iOSZp6f6aOp32pqVNozp', '618961a449e932293992a79d405a70603a01fa9ac424357dcd0933b068038cbba703b5379db5a84c590cc7903b4fd62fff94e52ead28992bed2d4f21b19c851b', 'prashanth@example.com')
---
	def create
		@user = User.new(params[:user])
		if @user.save

SELECT * FROM "users" WHERE ("users"."id" = '6') LIMIT 1
UPDATE "users" SET "persistence_token" = '38b8cc6e50ee2c5b85a45aced378ad3af0fd398a38a614005259b5e496dddd58c793ffc0dc0dcdc21a6f9c592ff5cbbaee7443315b91ca02fd71bc2972faa3a7', "updated_at" = '2010-09-09 18:59:10', "password_salt" = 'Ub660G3t6W9T8i6PibZw', "crypted_password" = '15274a10d2c95c538c0d6785ab5b6222d02499dd72bc435f0d40146eb75a6f7892963b2a9cd4a5c9f162ec92e1a2e5c6a9ae1ec6789618d58532019112dec778' WHERE "id" = 3
---
  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update_attributes(params[:user])